index.org
#+SETUPFILE: setup.org
#+OPTIONS: num:nil
#+OPTIONS: html-postamble:nil
#+OPTIONS: toc:nil
#+TITLE:

# sources:
# http://stackoverflow.com/questions/9092445/how-do-you-remove-numbering-from-headers-when-exporting-from-org-mode
# http://stackoverflow.com/questions/13363267/how-to-remove-footer-details-in-org-mode-html-export
# http://orgmode.org/manual/Table-of-contents.html

# example website with org-mode
# https://github.com/joshuaeckroth/cse3521-website

* Samuel Schulter
I'm a senior researcher in the [[http://www.nec-labs.com/research-departments/media-analytics/media-analytics-home][Media-Analytics Department at NEC-Labs America]] in Cupertino, CA.
My research interests are in computer vision and machine learning. I'm currently working on object detection and tracking in videos and higher-level 3D scene understanding.
I received my PhD in 2015 from Graz University of Technology under the supervision of Horst Bischof.

Email: samuel <at> nec-labs <dot> com

[[https://scholar.google.com/citations?user=VQ6dsFEAAAAJ][Google Scholar]]

* Publications
- *Domain Adaptation for Structured Output via Discriminative Patch Representations*. Y-H. Tsai, K. Sohn, S. Schulter, M. Chandraker. ICCV 2019. ([[http://openaccess.thecvf.com/content_ICCV_2019/papers/Tsai_Domain_Adaptation_for_Structured_Output_via_Discriminative_Patch_Representations_ICCV_2019_paper.pdf][PDF]], [[http://openaccess.thecvf.com/content_ICCV_2019/supplemental/Tsai_Domain_Adaptation_for_ICCV_2019_supplemental.pdf][SUPP]])
- *A Parametric Top-View Representation of Complex Road Scenes*. Z. Wang, B. Liu, S. Schulter, M. Chandraker. CVPR 2019. ([[http://openaccess.thecvf.com/content_CVPR_2019/papers/Wang_A_Parametric_Top-View_Representation_of_Complex_Road_Scenes_CVPR_2019_paper.pdf][PDF]], [[http://openaccess.thecvf.com/content_CVPR_2019/supplemental/Wang_A_Parametric_Top-View_CVPR_2019_supplemental.pdf][SUPP]])
- *A Dataset for High-level 3D Scene Understanding of Complex Road Scenes in the Top-View*. Z. Wang, B. Liu, S. Schulter, M. Chandraker. CVPR 2019 Workshop on 3D Scene Understanding for Vision, Graphics, and Robotics. ([[https://scene-understanding.com/papers/cvpr19_workshop_3d-scene-understanding_camera-ready_parametric-bev-dataset.pdf][PDF]])
- *Learning to Simulate*. N. Ruiz, S. Schulter, M. Chandraker. ICLR 2019. ([[https://arxiv.org/abs/1810.02513][PDF]])
- *Memory Warps for Learning Long-Term Online Video Representations*. T-H. Vu, W. Choi, S. Schulter, M. Chandraker. WACV 2019. ([[http://arxiv.org/abs/1803.10861][PDF]])
- *Learning to Look around Objects for Top-View Representations of Outdoor Scenes*. S. Schulter, M. Zhai, N. Jacobs, M. Chandraker. ECCV 2018. ([[http://arxiv.org/abs/1803.10870][PDF]])
- *Learning to Adapt Structured Output Space for Semantic Segmentation*. Y-H. Tsai, W-C. Hung, S. Schulter, K. Sohn, M-H. Yang, M. Chandraker. CVPR 2018. ([[http://openaccess.thecvf.com/content_cvpr_2018/papers/Tsai_Learning_to_Adapt_CVPR_2018_paper.pdf][PDF]], [[http://openaccess.thecvf.com/content_cvpr_2018/Supplemental/1435-supp.pdf][SUPP]])
- *Deep Network Flow for Multi-Object Tracking*. S. Schulter, P. Vernaza, W. Choi, M. Chandraker. CVPR 2017. [[http://www.nec-labs.com/uploads/images/Department-Images/MediaAnalytics/papers/cvpr17_deepnetworkflow.pdf][(PDF]], [[http://www.nec-labs.com/uploads/images/Department-Images/MediaAnalytics/papers/cvpr17_deepnetworkflow_supp.pdf][SUPP]])
- *Loss-Specific Training of Random Forests for Super-Resolution*. A. Grabner, G. Poier, M. Opitz, S. Schulter, P. M. Roth. Computer Vision Winter Workshop 2017. ([[http://cvww2017.prip.tuwien.ac.at/papers/CVWW2017_paper_23.pdf][PDF]])

- *Interactive 3D Segmentation of Rock-Art by Enhanced Depth Maps and Gradient Preserving Regularization*. M. Zeppelzauer, G. Poier, M. Seidl, C. Reinbacher, S. Schulter, C. Breiteneder, H. Bischof. ACM Journal on Computing and Cultural Heritage 9 (4): 19:1-19:30, 2016 ([[http://dx.doi.org/10.1145/2950062][PDF]])
- *Conditioned Regression Models for Non-Blind Single Image Super-Resolution*. G. Riegler, S. Schulter, M. Ruether, H. Bischof. ICCV 2015. ([[http://www.cv-foundation.org/openaccess/content_iccv_2015/papers/Riegler_Conditioned_Regression_Models_ICCV_2015_paper.pdf][PDF]])
- *Hybrid One-Shot 3D Hand Pose Estimation by Exploiting Uncertainties*. G. Poier, K. Roditakis, S. Schulter, D. Michel, H. Bischof A. A. Argyros. BMVC 2015. ([[https://files.icg.tugraz.at/f/0675245487/?raw%3D1][PDF]], [[https://www.tugraz.at/institute/icg/research/team-bischof/lrs/downloads/hybridhpe][PROJECT]])
- *Interactive Segmentation of Rock-Art in High-Resolution 3D Reconstructions*. M. Zeppelzauer, G. Poier, M. Seidl, C. Reinbacher, C. Breiteneder, H. Bischof, S. Schulter. Digital Heritage Conference 2015. ([[http://ieeexplore.ieee.org/document/7419450/][PDF]])
- *You Should Use Regression to Detect Cells*. P. Kainz, M. Urschler, S. Schulter, P. Wohlhart, V. Lepetit. MICCAI 2015. ([[https://link.springer.com/chapter/10.1007/978-3-319-24574-4_33][PDF]], [[https://github.com/pkainz/MICCAI2015][CODE]])
- *Fast and Accurate Super Resolution with Random Forests*. S. Schulter, C. Leistner, H. Bischof. CVPR 2015. ([[http://www.cv-foundation.org/openaccess/content_cvpr_2015/papers/Schulter_Fast_and_Accurate_2015_CVPR_paper.pdf][PDF]], [[http://lrs.icg.tugraz.at/pubs/schulter_cvpr_2015_supp.pdf][SUPP]], [[https://www.tugraz.at/institute/icg/research/team-bischof/learning-recognition-surveillance/downloads/forests/#srf][CODE]])

- *Hough Forests Revisited: An Approach to Multiple Instance Tracking from Multiple Cameras*. G. Poier, S. Schulter, S. Sternig, P. M. Roth, H. Bischof. GCPR 2014. ([[https://link.springer.com/chapter/10.1007/978-3-319-11752-2_41][PDF]])
- *Accurate Object Detection with Joint Classification-Regression Random Forests*. S. Schulter, C. Leistner, P. Wohlhart, P. M. Roth, H. Bischof. CVPR 2014. ([[http://www.cv-foundation.org/openaccess/content_cvpr_2014/papers/Schulter_Accurate_Object_Detection_2014_CVPR_paper.pdf][PDF]])

- *Alternating Regression Forests for Object Detection and Pose Estimation*. S. Schulter, C. Leistner, P. Wohlhart, P. M. Roth, H. Bischof. ICCV 2013. ([[http://www.cv-foundation.org/openaccess/content_iccv_2013/papers/Schulter_Alternating_Regression_Forests_2013_ICCV_paper.pdf][PDF]], [[https://www.tugraz.at/institute/icg/research/team-bischof/lrs/downloads/forests#adf][CODE]])
- *Unsupervised Object Discovery and Segmentation in Videos*. S. Schulter, C. Leistner, P. M. Roth, H. Bischof. BMVC 2013. ([[http://www.bmva.org/bmvc/2013/Papers/paper0053/][PDF]])
- *Ordinal Random Forests for Object Detection*. S. Schulter, P. M. Roth, H. Bischof. GCPR 2013. ([[https://link.springer.com/chapter/10.1007/978-3-642-40602-7_29][PDF]])
- *Alternating Decision Forests*. S. Schulter, P. Wohlhart, C. Leistner, A. Saffari, P. M. Roth, H. Bischof. CVPR 2013. ([[http://www.cv-foundation.org/openaccess/content_cvpr_2013/papers/Schulter_Alternating_Decision_Forests_2013_CVPR_paper.pdf][PDF]], [[https://www.tugraz.at/institute/icg/research/team-bischof/lrs/downloads/forests#adf][CODE]])

- *Discriminative Hough Forests for Object Detection*. P. Wohlhart, S. Schulter, M. Koestinger, P. M. Roth, H. Bischof. BMVC 2012. ([[http://www.bmva.org/bmvc/2012/BMVC/paper040/][PDF]])

- *Improving Classifiers with Unlabeled Weakly-Related Videos*. C. Leistner, M. Godec, S. Schulter, A. Saffari, M. Werlberger, H. Bischof. CVPR 2011. ([[http://ieeexplore.ieee.org/document/5995475/?reload%3Dtrue&arnumber%3D5995475][PDF]], [[https://www.tugraz.at/institute/icg/research/team-bischof/lrs/downloads/forests#vhf][CODE]])
- *On-line Hough Forests*. S. Schulter, C. Leistner, P. M. Roth, L. Van Gool, H. Bischof. BMVC 2011. ([[http://www.bmva.org/bmvc/2011/proceedings/paper128/paper128.pdf][PDF]], [[https://www.tugraz.at/institute/icg/research/team-bischof/lrs/downloads/forests#ohf][CODE]])
