index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-07-09 Tue 22:03 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Samuel Schulter" />
<link rel="stylesheet" href="css/main.css" type="text/css" media="screen" />
</head>
<body>
<div id="content">

<div id="outline-container-orgfd70494" class="outline-2">
<h2 id="orgfd70494">Samuel Schulter</h2>
<div class="outline-text-2" id="text-orgfd70494">
<p>
I'm a senior researcher in the <a href="http://www.nec-labs.com/research-departments/media-analytics/media-analytics-home">Media-Analytics Department at NEC-Labs America</a> in Cupertino, CA.
My research interests are in computer vision and machine learning. I'm currently working on object detection and tracking in videos and higher-level 3D scene understanding.
I received my PhD in 2015 from Graz University of Technology under the supervision of Horst Bischof.
</p>

<p>
Email: samuel &lt;at&gt; nec-labs &lt;dot&gt; com
</p>

<p>
<a href="https://scholar.google.com/citations?user=VQ6dsFEAAAAJ">Google Scholar</a>
</p>
</div>
</div>

<div id="outline-container-org48efe71" class="outline-2">
<h2 id="org48efe71">Publications</h2>
<div class="outline-text-2" id="text-org48efe71">
<ul class="org-ul">
<li><b>A Parametric Top-View Representation of Complex Road Scenes</b>. Z. Wang, B. Liu, S. Schulter, M. Chandraker. CVPR 2019. (<a href="http://openaccess.thecvf.com/content_CVPR_2019/papers/Wang_A_Parametric_Top-View_Representation_of_Complex_Road_Scenes_CVPR_2019_paper.pdf">PDF</a>, <a href="http://openaccess.thecvf.com/content_CVPR_2019/supplemental/Wang_A_Parametric_Top-View_CVPR_2019_supplemental.pdf">SUPP</a>)</li>
<li><b>A Dataset for High-level 3D Scene Understanding of Complex Road Scenes in the Top-View</b>. Z. Wang, B. Liu, S. Schulter, M. Chandraker. CVPR 2019 Workshop on 3D Scene Understanding for Vision, Graphics, and Robotics. (<a href="https://scene-understanding.com/papers/cvpr19_workshop_3d-scene-understanding_camera-ready_parametric-bev-dataset.pdf">PDF</a>)</li>
<li><b>Learning to Simulate</b>. N. Ruiz, S. Schulter, M. Chandraker. ICLR 2019. (<a href="https://arxiv.org/abs/1810.02513">PDF</a>)</li>
<li><b>Memory Warps for Learning Long-Term Online Video Representations</b>. T-H. Vu, W. Choi, S. Schulter, M. Chandraker. WACV 2019. (<a href="http://arxiv.org/abs/1803.10861">PDF</a>)</li>
<li><b>Learning to Look around Objects for Top-View Representations of Outdoor Scenes</b>. S. Schulter, M. Zhai, N. Jacobs, M. Chandraker. ECCV 2018. (<a href="http://arxiv.org/abs/1803.10870">PDF</a>)</li>
<li><b>Learning to Adapt Structured Output Space for Semantic Segmentation</b>. Y-H. Tsai, W-C. Hung, S. Schulter, K. Sohn, M-H. Yang, M. Chandraker. CVPR 2018. (<a href="http://openaccess.thecvf.com/content_cvpr_2018/papers/Tsai_Learning_to_Adapt_CVPR_2018_paper.pdf">PDF</a>, <a href="http://openaccess.thecvf.com/content_cvpr_2018/Supplemental/1435-supp.pdf">SUPP</a>)</li>
<li><b>Deep Network Flow for Multi-Object Tracking</b>. S. Schulter, P. Vernaza, W. Choi, M. Chandraker. CVPR 2017. <a href="http://www.nec-labs.com/uploads/images/Department-Images/MediaAnalytics/papers/cvpr17_deepnetworkflow.pdf">(PDF</a>, <a href="http://www.nec-labs.com/uploads/images/Department-Images/MediaAnalytics/papers/cvpr17_deepnetworkflow_supp.pdf">SUPP</a>)</li>
<li><b>Loss-Specific Training of Random Forests for Super-Resolution</b>. A. Grabner, G. Poier, M. Opitz, S. Schulter, P. M. Roth. Computer Vision Winter Workshop 2017. (<a href="http://cvww2017.prip.tuwien.ac.at/papers/CVWW2017_paper_23.pdf">PDF</a>)</li>

<li><b>Interactive 3D Segmentation of Rock-Art by Enhanced Depth Maps and Gradient Preserving Regularization</b>. M. Zeppelzauer, G. Poier, M. Seidl, C. Reinbacher, S. Schulter, C. Breiteneder, H. Bischof. ACM Journal on Computing and Cultural Heritage 9 (4): 19:1-19:30, 2016 (<a href="http://dx.doi.org/10.1145/2950062">PDF</a>)</li>
<li><b>Conditioned Regression Models for Non-Blind Single Image Super-Resolution</b>. G. Riegler, S. Schulter, M. Ruether, H. Bischof. ICCV 2015. (<a href="http://www.cv-foundation.org/openaccess/content_iccv_2015/papers/Riegler_Conditioned_Regression_Models_ICCV_2015_paper.pdf">PDF</a>)</li>
<li><b>Hybrid One-Shot 3D Hand Pose Estimation by Exploiting Uncertainties</b>. G. Poier, K. Roditakis, S. Schulter, D. Michel, H. Bischof A. A. Argyros. BMVC 2015. (<a href="https://files.icg.tugraz.at/f/0675245487/?raw=1">PDF</a>, <a href="https://www.tugraz.at/institute/icg/research/team-bischof/lrs/downloads/hybridhpe">PROJECT</a>)</li>
<li><b>Interactive Segmentation of Rock-Art in High-Resolution 3D Reconstructions</b>. M. Zeppelzauer, G. Poier, M. Seidl, C. Reinbacher, C. Breiteneder, H. Bischof, S. Schulter. Digital Heritage Conference 2015. (<a href="http://ieeexplore.ieee.org/document/7419450/">PDF</a>)</li>
<li><b>You Should Use Regression to Detect Cells</b>. P. Kainz, M. Urschler, S. Schulter, P. Wohlhart, V. Lepetit. MICCAI 2015. (<a href="https://link.springer.com/chapter/10.1007/978-3-319-24574-4_33">PDF</a>, <a href="https://github.com/pkainz/MICCAI2015">CODE</a>)</li>
<li><b>Fast and Accurate Super Resolution with Random Forests</b>. S. Schulter, C. Leistner, H. Bischof. CVPR 2015. (<a href="http://www.cv-foundation.org/openaccess/content_cvpr_2015/papers/Schulter_Fast_and_Accurate_2015_CVPR_paper.pdf">PDF</a>, <a href="http://lrs.icg.tugraz.at/pubs/schulter_cvpr_2015_supp.pdf">SUPP</a>, <a href="https://www.tugraz.at/institute/icg/research/team-bischof/learning-recognition-surveillance/downloads/forests/#srf">CODE</a>)</li>

<li><b>Hough Forests Revisited: An Approach to Multiple Instance Tracking from Multiple Cameras</b>. G. Poier, S. Schulter, S. Sternig, P. M. Roth, H. Bischof. GCPR 2014. (<a href="https://link.springer.com/chapter/10.1007/978-3-319-11752-2_41">PDF</a>)</li>
<li><b>Accurate Object Detection with Joint Classification-Regression Random Forests</b>. S. Schulter, C. Leistner, P. Wohlhart, P. M. Roth, H. Bischof. CVPR 2014. (<a href="http://www.cv-foundation.org/openaccess/content_cvpr_2014/papers/Schulter_Accurate_Object_Detection_2014_CVPR_paper.pdf">PDF</a>)</li>

<li><b>Alternating Regression Forests for Object Detection and Pose Estimation</b>. S. Schulter, C. Leistner, P. Wohlhart, P. M. Roth, H. Bischof. ICCV 2013. (<a href="http://www.cv-foundation.org/openaccess/content_iccv_2013/papers/Schulter_Alternating_Regression_Forests_2013_ICCV_paper.pdf">PDF</a>, <a href="https://www.tugraz.at/institute/icg/research/team-bischof/lrs/downloads/forests#adf">CODE</a>)</li>
<li><b>Unsupervised Object Discovery and Segmentation in Videos</b>. S. Schulter, C. Leistner, P. M. Roth, H. Bischof. BMVC 2013. (<a href="http://www.bmva.org/bmvc/2013/Papers/paper0053/">PDF</a>)</li>
<li><b>Ordinal Random Forests for Object Detection</b>. S. Schulter, P. M. Roth, H. Bischof. GCPR 2013. (<a href="https://link.springer.com/chapter/10.1007/978-3-642-40602-7_29">PDF</a>)</li>
<li><b>Alternating Decision Forests</b>. S. Schulter, P. Wohlhart, C. Leistner, A. Saffari, P. M. Roth, H. Bischof. CVPR 2013. (<a href="http://www.cv-foundation.org/openaccess/content_cvpr_2013/papers/Schulter_Alternating_Decision_Forests_2013_CVPR_paper.pdf">PDF</a>, <a href="https://www.tugraz.at/institute/icg/research/team-bischof/lrs/downloads/forests#adf">CODE</a>)</li>

<li><b>Discriminative Hough Forests for Object Detection</b>. P. Wohlhart, S. Schulter, M. Koestinger, P. M. Roth, H. Bischof. BMVC 2012. (<a href="http://www.bmva.org/bmvc/2012/BMVC/paper040/">PDF</a>)</li>

<li><b>Improving Classifiers with Unlabeled Weakly-Related Videos</b>. C. Leistner, M. Godec, S. Schulter, A. Saffari, M. Werlberger, H. Bischof. CVPR 2011. (<a href="http://ieeexplore.ieee.org/document/5995475/?reload=true&amp;arnumber=5995475">PDF</a>, <a href="https://www.tugraz.at/institute/icg/research/team-bischof/lrs/downloads/forests#vhf">CODE</a>)</li>
<li><b>On-line Hough Forests</b>. S. Schulter, C. Leistner, P. M. Roth, L. Van Gool, H. Bischof. BMVC 2011. (<a href="http://www.bmva.org/bmvc/2011/proceedings/paper128/paper128.pdf">PDF</a>, <a href="https://www.tugraz.at/institute/icg/research/team-bischof/lrs/downloads/forests#ohf">CODE</a>)</li>
</ul>
</div>
</div>
</div>
</body>
</html>
